WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/RpcLit/SoapWsdl.BaseDataTypes.XmlFormatter.RpcLit_RetDateTime_Client_Request-13.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesRpcLit/RetDateTime</a:Action>
    <a:MessageID>urn:uuid:1f22949a-3c89-4039-98fd-b197b61b5ca9</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetDateTime xmlns="http://tempuri.org/">
      <inDateTime xmlns="">2005-01-01T15:59:00-08:00</inDateTime>
    </RetDateTime>
  </s:Body>
</s:Envelope>